app/controllers/home_controller.rb

  def correct
    @words=Word.where(judge:"〇",user_id:current_user.id)
---
SELECT "words".* FROM "words" WHERE "words"."judge" = ? AND "words"."user_id" = ?  [["judge", "〇"], ["user_id", 3]]

  def mistake
    @words=Word.where(judge:"×",user_id:current_user.id)
---
SELECT "words".* FROM "words" WHERE "words"."judge" = ? AND "words"."user_id" = ?  [["judge", "×"], ["user_id", 3]]

  def correct_reverse
    @word=Word.find_by(id:params[:id])
    @word.judge="×"
    @word.save
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "×"], ["updated_at", "2021-02-08 23:39:40.985391"], ["id", 16]]

  def mistake_reverse
    @word=Word.find_by(id:params[:id])
    @word.judge="〇"
    @word.save
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "〇"], ["updated_at", "2021-02-08 23:39:46.732641"], ["id", 15]]