app/controllers/posts_controller.rb

  def index
    @words = Word.all
---
SELECT "words".* FROM "words"