app/controllers/posts_controller.rb

SELECT "words".* FROM "words" WHERE "words"."user_id" = ?  [["user_id", 3]]
---
  def index
    @words = Word.where(user_id: current_user.id)

INSERT INTO "words" ("word", "created_at", "updated_at", "meaning", "user_id") VALUES (?, ?, ?, ?, ?)  [["word", "unless"], ["created_at", "2021-04-12 23:07:51.228375"], ["updated_at", "2021-04-12 23:07:51.228375"], ["meaning", "アンレス"], ["user_id", 3]]
---
  def create
    @word=Word.new(word: params[:word],meaning: params[:meaning],user_id: current_user.id)
    @word.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 7]]
---
  def destroy
    @word=Word.find_by(id:params[:id],user_id:current_user.id)
    @word.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = ? AND "words"."user_id" = ? LIMIT ?  [["id", 59], ["user_id", 3], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "〇"], ["updated_at", "2021-02-08 22:06:02.306445"], ["id", 15]]
---
  def correct
    @word=Word.find_by(id:params[:id],user_id:current_user.id)
    @word.judge="〇"
    @word.save

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "×"], ["updated_at", "2021-02-08 22:06:04.599694"], ["id", 15]]
---
  def mistake
    @word=Word.find_by(id:params[:id],user_id:current_user.id)
    @word.judge="×"
    @word.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = ? AND "words"."user_id" = ? LIMIT ?  [["id", 63], ["user_id", 4], ["LIMIT", 1]]
---
  def edit
    @word=Word.find_by(id:params[:id],user_id:current_user.id)

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "words" SET "meaning" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["meaning", "もし"], ["updated_at", "2021-02-09 21:04:46.260863"], ["id", 18]]
---
  def edit_meaning
    @word=Word.find_by(id:params[:id],user_id:current_user.id)
    @word.meaning= params[:meaning]
    @word.save

SELECT  "words".* FROM "words" WHERE "words"."user_id" = ? ORDER BY RANDOM() LIMIT ?  [["user_id", 7], ["LIMIT", 4]]
---
  def quiz
    @words=Word.where(user_id:params[:user_id]).order("RANDOM()").limit(4)

SELECT "words".* FROM "words" WHERE (id >= 52)
---
  def answer
    @word=Word.find_by(id:params[:id])

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "〇"], ["updated_at", "2021-04-29 13:36:03.442016"], ["id", 70]]
---
  def ans_correct
    @word=Word.find_by(id:params[:id])
    @word.judge="〇"
    @word.save

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
UPDATE "words" SET "judge" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["judge", "×"], ["updated_at", "2021-04-29 14:07:55.815489"], ["id", 65]]
---
  def ans_mistake
    @word=Word.find_by(id:params[:id])
    @word.judge="×"
    @word.save